#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_id.bucket_suffix: Refreshing state... [id=nqESug]
google_compute_network.vpc: Refreshing state... [id=projects/mike-personal-portfolio/global/networks/flash-crash-vpc]
google_iam_workload_identity_pool.github_pool: Refreshing state... [id=projects/mike-personal-portfolio/locations/global/workloadIdentityPools/github-actions-pool]
google_storage_bucket.temp_bucket: Refreshing state... [id=flash-crash-staging-9ea112ba]
google_service_account.dataflow_sa: Refreshing state... [id=projects/mike-personal-portfolio/serviceAccounts/flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_pubsub_topic.stock_ticks: Refreshing state... [id=projects/mike-personal-portfolio/topics/stock-ticks-topic]
google_storage_bucket.dataflow_templates: Refreshing state... [id=flash-crash-templates-9ea112ba]
google_artifact_registry_repository.repo: Refreshing state... [id=projects/mike-personal-portfolio/locations/us-central1/repositories/flash-crash-repo]
google_bigquery_dataset.dataset: Refreshing state... [id=projects/mike-personal-portfolio/datasets/flash_crash_data]
google_pubsub_subscription.stock_ticks_sub: Refreshing state... [id=projects/mike-personal-portfolio/subscriptions/stock-ticks-sub]
google_project_iam_member.dataflow_worker["roles/pubsub.editor"]: Refreshing state... [id=mike-personal-portfolio/roles/pubsub.editor/serviceAccount:flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_project_iam_member.dataflow_worker["roles/dataflow.admin"]: Refreshing state... [id=mike-personal-portfolio/roles/dataflow.admin/serviceAccount:flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_project_iam_member.dataflow_worker["roles/bigquery.dataEditor"]: Refreshing state... [id=mike-personal-portfolio/roles/bigquery.dataEditor/serviceAccount:flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_project_iam_member.dataflow_worker["roles/dataflow.worker"]: Refreshing state... [id=mike-personal-portfolio/roles/dataflow.worker/serviceAccount:flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_project_iam_member.dataflow_worker["roles/storage.objectAdmin"]: Refreshing state... [id=mike-personal-portfolio/roles/storage.objectAdmin/serviceAccount:flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_service_account_iam_member.wif_binding: Refreshing state... [id=projects/mike-personal-portfolio/serviceAccounts/flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/166016129616/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/mike-personal-portfolio/flash_crash_detector]
google_compute_router.router: Refreshing state... [id=projects/mike-personal-portfolio/regions/us-central1/routers/dataflow-router]
google_compute_firewall.dataflow_internal: Refreshing state... [id=projects/mike-personal-portfolio/global/firewalls/allow-dataflow-internal]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/mike-personal-portfolio/regions/us-central1/subnetworks/dataflow-subnet]
google_bigquery_table.table: Refreshing state... [id=projects/mike-personal-portfolio/datasets/flash_crash_data/tables/aggregated_stats]
google_compute_router_nat.nat: Refreshing state... [id=mike-personal-portfolio/us-central1/dataflow-router/dataflow-nat]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_iam_workload_identity_pool_provider.github_provider will be created
  + resource "google_iam_workload_identity_pool_provider" "github_provider" {
      + attribute_mapping                  = {
          + "google.subject" = "assertion.sub"
        }
      + display_name                       = "GitHub Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "mike-personal-portfolio"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "github-actions-pool"
      + workload_identity_pool_provider_id = "github-provider"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # google_service_account_iam_member.wif_binding must be replaced
-/+ resource "google_service_account_iam_member" "wif_binding" {
      ~ etag               = "BwZI0R0SX24=" -> (known after apply)
      ~ id                 = "projects/mike-personal-portfolio/serviceAccounts/flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/166016129616/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/mike-personal-portfolio/flash_crash_detector" -> (known after apply)
      ~ member             = "principalSet://iam.googleapis.com/projects/166016129616/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/mike-personal-portfolio/flash_crash_detector" -> "principalSet://iam.googleapis.com/projects/166016129616/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository//flash_crash_detector" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + wif_provider_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>